uat_chat/Catalogs/уатСтавкиПоТранспортномуНалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатСтавкиПоТранспортномуНалогу</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыТСТранспортныйНалог</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛСилОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛСилДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кВтОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кВтДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Catalogs/уатСтавкиПоТранспортномуНалогу/Ext/ManagerModule.bsl
// Функция возвращает список возможных наименований для элемента справочника
//
// Параметры:
//  СпрОбъект    - элемент для которого надо получить наименование
Функция ПолучитьСписокВозможныхНаименований(СпрОбъект) Экспорт
	мСписок = Новый СписокЗначений;
	СтрокаНаим = "" + СпрОбъект.Вид + ", от " + СпрОбъект.ЛСилОт + " л.с. до " + СпрОбъект.ЛСилДо + " л.с."; 
	мСписок.Добавить(СтрокаНаим);
	СтрокаНаим = "" + СпрОбъект.Вид + ", от " + СпрОбъект.ЛСилОт + " л.с. до " + СпрОбъект.ЛСилДо + " л.с., ставка " + СпрОбъект.Ставка; 
	мСписок.Добавить(СтрокаНаим);
	СтрокаНаим = "" + СпрОбъект.Вид + ", ставка " + СпрОбъект.Ставка; 
	мСписок.Добавить(СтрокаНаим);
	Возврат мСписок;
КонецФункции
